"""
    Дан массив цен акций, вывести список, содержащий темпы прироста от периода к периоду.
    Для первого элемента списка выведите значение None. Округлите до целых.
    Например: [100, 150, 300, 400] -> [None, 50%, 100%, 33%]
"""


def get_pct_growth(s: list[float]) -> list[str]:
    return [None] + [f'{(s[i + 1] - s[i])/s[i]:.0%}' for i in range(len(s) - 1)]


if __name__ == '__main__':
    assert get_pct_growth([100, 150, 300, 400]) == [None, '50%', '100%', '33%']
    print('All tests pass')